<?php

namespace Database\Seeders;

use Carbon\Carbon;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PrivacyPoliciesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('privacy_policies')->insert([
            [
                'title' => 'プライバシーポリシー',
                'content' => <<<TEXT
株式会社グローバル（以下「当社」といいます。）は、システム開発、機械学習プラットフォーム、WEBシステム開発、モバイルアプリ開発などの事業を行うにあたり、お客様の個人情報の保護について、社会的責任を十分に認識し、情報主体の権利の保護、個人情報に関する法規制等を遵守致します。

以下に定めるプライバシーポリシーに基づき、個人情報の適切な取扱い・管理に努めます。

1. 個人情報の定義
本プライバシーポリシーにおいて「個人情報」とは、個人情報の保護に関する法律（以下「個人情報保護法」といいます）にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報を指します。また、他の情報と容易に照合することができ、それにより特定の個人を識別することができることとなる情報も含みます。

2. 個人情報の収集方法
当社は、お問い合わせフォームのご利用、お取引における契約締結、採用活動などにおいて、適法かつ公正な手段により、業務上必要な範囲で個人情報を取得いたします。

3. 個人情報の利用目的
当社が収集・保有する個人情報の利用目的は以下のとおりです。

当社が提供する各種サービス（システム開発、WEB・モバイルアプリ開発、AI・機械学習関連サービス等）の提供およびそれに伴う連絡・サポート

お問い合わせ、ご相談、お見積り依頼に対する回答および資料送付

契約の履行、商談、打合せ等の連絡

当社のサービス向上、新規開発、マーケティング活動のための分析（個人を特定しない統計データとしての活用）

採用活動における応募者への連絡および情報提供、採用選考

その他、上記利用目的に付随する目的

4. 個人情報の利用目的の変更
当社は、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。利用目的の変更を行った場合は、変更後の目的について、当社ウェブサイトに公表するものとします。

5. 個人情報の第三者提供
当社は、次に掲げる場合を除いて、あらかじめお客様の同意を得ることなく、第三者に個人情報を提供することはありません。ただし、個人情報保護法その他の法令で認められる場合を除きます。

法令に基づく場合   

人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき   

公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき   

国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき   

予め次の事項を告知あるいは公表し、かつ当社が個人情報保護委員会に届出をしたとき

利用目的に第三者への提供を含むこと

第三者に提供されるデータの項目

第三者への提供の手段または方法

本人の求めに応じて個人情報の第三者への提供を停止すること

本人の求めを受け付ける方法

6. 個人情報の安全管理
当社は、個人情報の紛失、破壊、改ざんおよび漏洩などを防止するため、不正アクセス対策、コンピュータウイルス対策等、必要かつ適切な情報セキュリティ対策を講じます。また、役員および従業員に対する教育啓発活動を実施し、個人情報の安全管理が図られるよう適切に監督します。

7. 個人情報の開示・訂正・削除等
お客様ご本人から、個人情報の開示、訂正、追加、削除、利用停止、または消去（以下「開示等」といいます）のお求めがあった場合には、ご本人確認を行ったうえで、法令の定めに基づき速やかに対応いたします。開示等のお手続きに関する詳細については、下記のお問い合わせ窓口までご連絡ください。

8. プライバシーポリシーの改定
本ポリシーの内容は、法令の改正その他当社の事業内容の変更等に伴い、事前の予告なく改定することがあります。改定後のプライバシーポリシーは、当社ウェブサイトに掲載したときから効力を生じるものとします。

9. お問い合わせ窓口
当社の個人情報の取扱いに関するお問い合わせは、下記までご連絡ください。

会社名：株式会社グローバル

所在地：〒166-0004 東京都杉並区阿佐谷南1-14-20 ファーストビル阿佐谷 3F

連絡先：TEL 03-3292-5461 / FAX 03-5929-8730

受付時間：平日（※会社の営業日に準ずる）
TEXT,
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
        ]);
    }
}
